# Shell & prompt
brew "zsh"
brew "starship"
brew "atuin"
brew "zoxide"
brew "fzf"
brew "thefuck"
brew "direnv"

# File & text tools
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "jq"
brew "ncdu"

# Git
brew "git"
brew "git-delta"
brew "lazygit"
brew "gh"

# Terminal multiplexer & system
brew "tmux"
brew "btop"
brew "stow"
brew "mise"

# Editor
brew "neovim"
